In [1]:
import pandas as pd

In [2]:
s = pd.Series(range(10_000))

In [3]:
%%timeit
total = 0
for val in s:
    total += val

1 ms ± 11 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [4]:
%timeit s.sum()

11.4 µs ± 393 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [5]:
1020_00/11

9272.727272727272

In [6]:
df = pd.read_csv('Fontes/cart.csv')

In [7]:
df

  Customer         Item  Amount  Item Price
0     Rick         Wine      20      103.20
1    Morty  Almond Milk       1       10.04
2   Summer    Ice Cream       1        8.32
3     Beth         Comb       1        7.30
4    Jerry      Tequila       2       20.34

In [8]:
df['Item Price'] > 10

0     True
1     True
2    False
3    False
4     True
Name: Item Price, dtype: bool

In [9]:
mask = df['Item Price'] > 10

In [10]:
df[mask]

  Customer         Item  Amount  Item Price
0     Rick         Wine      20      103.20
1    Morty  Almond Milk       1       10.04
4    Jerry      Tequila       2       20.34

In [11]:
df[df['Item Price'] > 10]

  Customer         Item  Amount  Item Price
0     Rick         Wine      20      103.20
1    Morty  Almond Milk       1       10.04
4    Jerry      Tequila       2       20.34

In [12]:
import sqlite3

In [15]:
conn = sqlite3.connect('Fontes/logs.db', detect_types=sqlite3.PARSE_DECLTYPES)

In [16]:
df = pd.read_sql('SELECT * FROM logs', conn)

In [ ]:
len(df)

10000

In [ ]:
%%timeit
total = 0
for _, row in df.iterrows():
    if row['status_code'] >= 400:
        total += 1

326 ms ± 5.72 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [ ]:
%timeit len(df[df['status_code'] >= 400])

183 µs ± 3.48 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

In [ ]:
326_000/183

1781.4207650273224

In [ ]:
%timeit max(s)

724 µs ± 25.5 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [ ]:
%timeit s.max()

12.6 µs ± 373 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [ ]:
724/12.6

57.46031746031746